import Image from "next/image";

export default function MohannadPage() {
  return (
    <div className="container mx-auto py-12  mt-12 px-4">
      <div className="max-w-xl mx-auto bg-white rounded-2xl shadow-lg p-8 text-center">
        <Image
          src="/73.jpg"
          alt="د. مهند الكسواني"
          className="w-48 h-auto mx-auto mb-4 rounded-xl"
        />
        <h1 className="text-2xl font-bold mb-2">د. مهند الكسواني</h1>
        <p className="text-lg text-gray-600 mb-4">
          Airway dentist <br />
          Snoring and mouth breathing physician <br />
          عضو في الجمعية البريطانية لطب أمراض النوم المتعلق بطب الأسنان
        </p>
        <p className="text-gray-700 mb-4">
          المحاضر الدولي في علوم طب الأسنان الرقمي وإطباق الأسنان والابتسامة
          الرقمية وطب الأسنان المتعلق بالشخير واضطراب التنفس أثناء النوم
        </p>

        <div className="text-gray-700 text-right">
          <h2 className="text-xl font-semibold mb-3">نبذة عن الدكتور مهند</h2>
          <p className="mb-4">
            حصل الدكتور مهند الكسواني على درجة الماجستير في علوم الخدمة الصحية
            من كلية الجراحين في لندن. يعرف الدكتور بشهاداته وخبراته الواسعة في
            مجال طب الأسنان وزراعة الأسنان.
          </p>

          <h2 className="text-xl font-semibold mb-3">المؤسس والمدير</h2>
          <p className="mb-4">
            مؤسس ومدير المركز الأوروبي لطب الأسنان، المتميز في خدماته، وخصوصًا
            زراعة الأسنان بأنواعها؛ زراعة الأسنان الموجهة بالحاسوب، أو زراعة
            الأسنان الفورية -48 ساعة-. يعرف مركز الدكتور مهند الكسواني المركز
            الأوروبي لطب الأسنان بتميزه الدائم. ويشتهر بتقديم خدمات شاملة عالية
            الجودة مع أفضل فريق عمل من أطباء وأخصائيين.
          </p>

          <h2 className="text-xl font-semibold mb-3">الإنجازات والعضويات</h2>
          <p className="mb-4">
            عضو في الجمعية الأوروبية لتجميل الأسنان. محاضر دولي في طب الأسنان
            الرقمي، والابتسامة الرقمية. أصبح الدكتور مهند الكسواني مؤخراً عضواً
            في الجمعية البريطانية لطب أمراض النوم المتعلق بطب الأسنان (British
            Society of Dental Sleep Medicine)، مما يعكس التزامه المستمر بأحدث
            التطورات في مجال صحة النوم والعلاقة الوثيقة بينها وبين طب الأسنان،
            ويؤكد سعيه الدائم لتقديم أفضل الحلول العلاجية لمشاكل الشخير
            واضطرابات التنفس المرتبطة بالحجرة الفموية.
          </p>

          <h2 className="text-xl font-semibold mb-3">نهجه العلاجي والتوعوي</h2>
          <p>
            يؤمن الدكتور مهند بالممارسات الأخلاقية خلال ممارسة المهنة. يضمن
            الدكتور مشاركة المريض في صنع القرار خلال رحلة العلاج لتحديد قرارات
            بروتوكولات العلاج المناسبة، الأكثر ملاءمة لكل فرد. يعد الدكتور مهند
            أحد موجهي وحاملي رسالة المحتوى الطبي؛ يقدم المعلومات الطبية حول
            زراعة الأسنان وغيرها من المعلومات المهمة في طب الأسنان على منصات
            التواصل الاجتماعي الخاصة به.
          </p>
        </div>
      </div>
    </div>
  );
}
